# Curve Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RuledFace..::..Curve Property
RuledFace Class See Also
---
Profile curves of the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve this[
	int index
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Curve ( _
	index As Integer _
) As Curve
	Get
```

Visual C++
---
```text
public:
property Curve^ Curve[int index] {
	Curve^ get (int index);
}
```

# ### Parameters
index
    Type: System..::..Int32
# See Also
RuledFace Class
Autodesk.Revit.DB Namespace